# New Section

In [2]:
#A
import pandas as pd
import numpy as np
df = pd.read_csv('train.csv')

missing_values = df.isnull().sum()
print("Missing values in each column:")
print(missing_values)

Missing values in each column:
Unnamed: 0              0
Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 2
Engine                 36
Power                  36
Seats                  38
New_Price            5032
Price                   0
dtype: int64

In [3]:
#B
df.loc[:, 'Mileage'] = df['Mileage'].astype(str).str.replace(r' kmpl| km/kg', '', regex=True).astype(float)

df['Engine'] = df['Engine'].astype(str).str.replace(' CC', '')

# Replace 'nan' string with actual NaN values
df['Engine'] = df['Engine'].replace('nan', np.nan)

# Convert the Engine column to float, fill NaN values with 0, and then convert to integer
df['Engine'] = df['Engine'].astype(float).fillna(0).astype(int)
df['Power'] = df['Power'].astype(str)

# Remove units from Power and convert to float
df['Power'] = df['Power'].str.replace(' bhp', '').astype(float)


df['New_Price'] = df['New_Price'].astype(str).str.replace(r' Lakh| Cr', '', regex=True).astype(float)
print(df.head())

   Unnamed: 0                              Name    Location  Year  \
0           1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1           2                      Honda Jazz V     Chennai  2011
2           3                 Maruti Ertiga VDI     Chennai  2012
3           4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4           6            Nissan Micra Diesel XV      Jaipur  2013

   Kilometers_Driven Fuel_Type Transmission Owner_Type  Mileage  Engine  \
0              41000    Diesel       Manual      First    19.67    1582
1              46000    Petrol       Manual      First    13.00    1199
2              87000    Diesel       Manual      First    20.77    1248
3              40670    Diesel    Automatic     Second    15.20    1968
4              86999    Diesel       Manual      First    23.08    1461

    Power  Seats  New_Price  Price
0  126.20    5.0        NaN  12.50
1   88.70    5.0       8.61   4.50
2   88.76    7.0        NaN   6.00
3  140.80    5.0        NaN  17.74
4   63.10    5.0        NaN   3.50

<ipython-input-3-09588a461ae1>:2: DeprecationWarning: In a future version, `df.iloc[:, i] = newvals` will attempt to set the values inplace instead of always setting a new array. To retain the old behavior, use either `df[df.columns[i]] = newvals` or, if columns are non-unique, `df.isetitem(i, newvals)`
  df.loc[:, 'Mileage'] = df['Mileage'].astype(str).str.replace(r' kmpl| km/kg', '', regex=True).astype(float)

In [4]:
#C
print(df.columns)

# Check if the specified columns exist in the DataFrame
if 'Fuel_Type_Diesel' in df.columns and 'Transmission_Automatic' in df.columns:
    # Create one-hot encoded representations of categorical variables
    hot_encoded = pd.get_dummies(df, columns=['Fuel_Type_Diesel', 'Transmission_Automatic'])

    # Display the first few rows of the DataFrame with one-hot encoded variables
    print(hot_encoded.head())
else:
    print("Specified columns not found in the DataFrame.")

Index(['Unnamed: 0', 'Name', 'Location', 'Year', 'Kilometers_Driven',
       'Fuel_Type', 'Transmission', 'Owner_Type', 'Mileage', 'Engine', 'Power',
       'Seats', 'New_Price', 'Price'],
      dtype='object')
Specified columns not found in the DataFrame.

In [5]:
#d
from datetime import datetime

# Calculate the current year
current_year = datetime.now().year

# Create a new feature representing the current age of the car
df['Current_Age'] = current_year - df['Year']

# Display the updated DataFrame
print(df.head())

   Unnamed: 0                              Name    Location  Year  \
0           1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1           2                      Honda Jazz V     Chennai  2011
2           3                 Maruti Ertiga VDI     Chennai  2012
3           4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4           6            Nissan Micra Diesel XV      Jaipur  2013

   Kilometers_Driven Fuel_Type Transmission Owner_Type  Mileage  Engine  \
0              41000    Diesel       Manual      First    19.67    1582
1              46000    Petrol       Manual      First    13.00    1199
2              87000    Diesel       Manual      First    20.77    1248
3              40670    Diesel    Automatic     Second    15.20    1968
4              86999    Diesel       Manual      First    23.08    1461

    Power  Seats  New_Price  Price  Current_Age
0  126.20    5.0        NaN  12.50            9
1   88.70    5.0       8.61   4.50           13
2   88.76    7.0        NaN   6.00           12
3  140.80    5.0        NaN  17.74           11
4   63.10    5.0        NaN   3.50           11

In [6]:
#E
# Select operation (selecting specific columns)
selected_columns = df[['Year', 'Mileage', 'Price']]

# Filter operation (filtering rows based on condition)
filtered_data = df[df['Year'] >= 2010]

# Rename operation (renaming columns)
renamed_columns = df.rename(columns={'Mileage': 'Car_Mileage', 'Price': 'Price_in_Lakhs'})

# Mutate operation (creating a new column based on existing columns)
df['Price_in_Thousands'] = df['Price'] * 1000

# Arrange operation (sorting rows based on one or more columns)
arranged_data = df.sort_values(by='Price', ascending=False)

# Summarize with group by operation (calculating summary statistics for groups)
summary_statistics = df.groupby('Year')['Price'].agg(['mean', 'median', 'min', 'max'])

# Displaying the results
print("Selected Columns:")
print(selected_columns.head())

print("\nFiltered Data:")
print(filtered_data.head())

print("\nRenamed Columns:")
print(renamed_columns.head())

print("\nMutated DataFrame:")
print(df.head())

print("\nArranged Data:")
print(arranged_data.head())

print("\nSummary Statistics:")
print(summary_statistics.head())

Selected Columns:
   Year  Mileage  Price
0  2015    19.67  12.50
1  2011    13.00   4.50
2  2012    20.77   6.00
3  2013    15.20  17.74
4  2013    23.08   3.50

Filtered Data:
   Unnamed: 0                              Name    Location  Year  \
0           1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1           2                      Honda Jazz V     Chennai  2011
2           3                 Maruti Ertiga VDI     Chennai  2012
3           4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4           6            Nissan Micra Diesel XV      Jaipur  2013

   Kilometers_Driven Fuel_Type Transmission Owner_Type  Mileage  Engine  \
0              41000    Diesel       Manual      First    19.67    1582
1              46000    Petrol       Manual      First    13.00    1199
2              87000    Diesel       Manual      First    20.77    1248
3              40670    Diesel    Automatic     Second    15.20    1968
4              86999    Diesel       Manual      First    23.08    1461

    Power  Seats  New_Price  Price  Current_Age
0  126.20    5.0        NaN  12.50            9
1   88.70    5.0       8.61   4.50           13
2   88.76    7.0        NaN   6.00           12
3  140.80    5.0        NaN  17.74           11
4   63.10    5.0        NaN   3.50           11

Renamed Columns:
   Unnamed: 0                              Name    Location  Year  \
0           1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1           2                      Honda Jazz V     Chennai  2011
2           3                 Maruti Ertiga VDI     Chennai  2012
3           4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4           6            Nissan Micra Diesel XV      Jaipur  2013

   Kilometers_Driven Fuel_Type Transmission Owner_Type  Car_Mileage  Engine  \
0              41000    Diesel       Manual      First        19.67    1582
1              46000    Petrol       Manual      First        13.00    1199
2              87000    Diesel       Manual      First        20.77    1248
3              40670    Diesel    Automatic     Second        15.20    1968
4              86999    Diesel       Manual      First        23.08    1461

    Power  Seats  New_Price  Price_in_Lakhs  Current_Age
0  126.20    5.0        NaN           12.50            9
1   88.70    5.0       8.61            4.50           13
2   88.76    7.0        NaN            6.00           12
3  140.80    5.0        NaN           17.74           11
4   63.10    5.0        NaN            3.50           11

Mutated DataFrame:
   Unnamed: 0                              Name    Location  Year  \
0           1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1           2                      Honda Jazz V     Chennai  2011
2           3                 Maruti Ertiga VDI     Chennai  2012
3           4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4           6            Nissan Micra Diesel XV      Jaipur  2013

   Kilometers_Driven Fuel_Type Transmission Owner_Type  Mileage  Engine  \
0              41000    Diesel       Manual      First    19.67    1582
1              46000    Petrol       Manual      First    13.00    1199
2              87000    Diesel       Manual      First    20.77    1248
3              40670    Diesel    Automatic     Second    15.20    1968
4              86999    Diesel       Manual      First    23.08    1461

    Power  Seats  New_Price  Price  Current_Age  Price_in_Thousands
0  126.20    5.0        NaN  12.50            9             12500.0
1   88.70    5.0       8.61   4.50           13              4500.0
2   88.76    7.0        NaN   6.00           12              6000.0
3  140.80    5.0        NaN  17.74           11             17740.0
4   63.10    5.0        NaN   3.50           11              3500.0

Arranged Data:
      Unnamed: 0                                         Name    Location  \
3952        4079  Land Rover Range Rover 3.0 Diesel LWB Vogue   Hyderabad
5620        5781                   Lamborghini Gallardo Coupe       Delhi
5752        5919                       Jaguar F Type 5.0 V8 S   Hyderabad
1457        1505              Land Rover Range Rover Sport SE       Kochi
1917        1974                           BMW 7 Series 740Li  Coimbatore

      Year  Kilometers_Driven Fuel_Type Transmission Owner_Type  Mileage  \
3952  2017              25000    Diesel    Automatic      First    13.33
5620  2011               6500    Petrol    Automatic      Third     6.40
5752  2015               8000    Petrol    Automatic      First    12.50
1457  2019              26013    Diesel    Automatic      First    12.65
1917  2018              28060    Petrol    Automatic      First    12.05

      Engine  Power  Seats  New_Price   Price  Current_Age  Price_in_Thousands
3952    2993  255.0    5.0       2.30  160.00            7            160000.0
5620    5204  560.0    2.0        NaN  120.00           13            120000.0
5752    5000  488.1    2.0        NaN  100.00            9            100000.0
1457    2993  255.0    5.0       1.39   97.07            5             97070.0
1917    2979  320.0    5.0        NaN   93.67            6             93670.0

Summary Statistics:
          mean  median   min   max
Year
1998  1.626667   0.530  0.45  3.90
1999  0.835000   0.835  0.77  0.90
2000  1.175000   1.100  0.55  1.95
2001  0.920000   0.750  0.70  1.45
2002  1.321667   1.100  0.51  3.65